rainbow = {
    'violet', # 1
    'red',    # 2
    'orange', # 3
    'yellow', # 4
    'green',  # 5
    'blue',   # 6
    'violet'} # 7
rgb = {'red', 'green', 'blue'}
print(len(rainbow))

letters = set('Мама мыла раму')

if 'а' in letters:
    print('Есть такая буква!')
# Напечатайте это множество

print(letters)
print('Логическое in')
print('а' in letters)

# Задайте множество чётных чисел (от 1 до 10)
chet = {2, 4, 6, 8}
# множество чисел, делящихся на 3.
natri = {3, 6, 9}
# Получите множество чисел, делящихся на 6.
na6 = {6}
# Получите множество чисел, не делящихся на 6.

# Получите множество нечётных чисел делящихся на 3
nechet3 = {3, 9}
