# Игра "Быки и Коровы"

# Главный цикл игры
# 1. Загадать число из 4 разных цифр
# 2. Внутренний цикл: пока число не угадано 
#    (пока не 4 быка, пока попытка не равна загаданному числу)
#    2.1. Попытка пользователя
#    2.2. Оценка попытки
#    2.3. Подсказка пользователю


# Главный цикл игры
# 1. Загадать число из 4 разных цифр
def prepare():
    #1/0
    return '1234'
# 2. Внутренний цикл: пока число не угадано 
#    (пока не 4 быка, пока попытка не равна загаданному числу)
#    2.1. Попытка пользователя
#    2.2. Оценка попытки
#    2.3. Подсказка пользователю